mg.xml

<?xml version='1.0' encoding='UTF-8' ?>
<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/'
                  xmlns:agen='http://www.moneygram.com/AgentConnect1305'>
    <soapenv:Header/>
    <soapenv:Body>
        <agen:referenceNumberRequest>
            <agen:agentID>43817027</agen:agentID>
            <agen:agentSequence>08</agen:agentSequence>
            <agen:token>TEST</agen:token>
            <agen:language>en</agen:language>
            <agen:timeStamp>2020-09-07T17:19:21.140-00:00</agen:timeStamp>
            <agen:apiVersion>1305</agen:apiVersion>
            <agen:clientSoftwareVersion>Ver 1</agen:clientSoftwareVersion>
            <agen:referenceNumber>43742501</agen:referenceNumber>
        </agen:referenceNumberRequest>
    </soapenv:Body>
</soapenv:Envelope><?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<soapenv:Body>
    <ac:referenceNumberResponse xmlns:ac="http://www.moneygram.com/AgentConnect1305">
        <ac:doCheckIn>false</ac:doCheckIn>
        <ac:timeStamp>2020-09-07T12:19:28.054-05:00</ac:timeStamp>
        <ac:flags>1</ac:flags>
        <ac:mgiTransactionSessionID>438170278E15994991675367416646</ac:mgiTransactionSessionID>
        <ac:senderFirstName>PHARRINGALBERTASTIEN</ac:senderFirstName>
        <ac:senderMiddleName>C'OMARASWAMANUSHTANU</ac:senderMiddleName>
        <ac:senderLastName>A'LBERTASTIENPHERRINGCOLADAREN</ac:senderLastName>
        <ac:senderLastName2>K'LBERTASTIENPHERRINGCOLADAREN</ac:senderLastName2>
        <ac:senderHomePhone>98858854526404</ac:senderHomePhone>
        <ac:receiverFirstName>PHARRIOGALBERTASTIEO</ac:receiverFirstName>
        <ac:receiverMiddleName>COOMARASWAMANUSHTANI</ac:receiverMiddleName>
        <ac:receiverLastName>E'LBERTASTIENPHERRINGCOLADAREN</ac:receiverLastName>
        <ac:receiverLastName2>B'LBERTASTIENPHERRINGCOLADAREN</ac:receiverLastName2>
        <ac:agentCheckNumber>998888888880</ac:agentCheckNumber>
        <ac:agentCheckAmount>278042.160</ac:agentCheckAmount>
        <ac:agentCheckAuthorizationNumber>10595</ac:agentCheckAuthorizationNumber>
        <ac:customerCheckNumber>0000000000</ac:customerCheckNumber>
        <ac:customerCheckAmount>0.000</ac:customerCheckAmount>
        <ac:okForAgent>true</ac:okForAgent>
        <ac:deliveryOption>WILL_CALL</ac:deliveryOption>
        <ac:transactionStatus>RECVD</ac:transactionStatus>
        <ac:dateTimeSent>2020-08-05T11:55:29.000-05:00</ac:dateTimeSent>
        <ac:receiveCurrency>XOF</ac:receiveCurrency>
        <ac:receiveAmount>278042.16</ac:receiveAmount>
        <ac:referenceNumber>43742501</ac:referenceNumber>
        <ac:originatingCountry>USA</ac:originatingCountry>
        <ac:validIndicator>false</ac:validIndicator>
        <ac:indicativeReceiveAmount>0</ac:indicativeReceiveAmount>
        <ac:indicativeExchangeRate>0.000000</ac:indicativeExchangeRate>
        <ac:receiveAgentName>NETSERVICES SENEGAL</ac:receiveAgentName>
        <ac:expectedDateOfDelivery>2020-08-05</ac:expectedDateOfDelivery>
        <ac:originalSendAmount>500.00</ac:originalSendAmount>
        <ac:originalSendCurrency>USD</ac:originalSendCurrency>
        <ac:originalSendFee>0.00</ac:originalSendFee>
        <ac:originalExchangeRate>556.084328</ac:originalExchangeRate>
        <ac:redirectIndicator>false</ac:redirectIndicator>
        <ac:okForPickup>false</ac:okForPickup>
        <ac:notOkForPickupReasonCode>609</ac:notOkForPickupReasonCode>
        <ac:notOkForPickupReasonDescription>Transaction not in Send status</ac:notOkForPickupReasonDescription>
        <ac:minutesUntilOkForPickup>0</ac:minutesUntilOkForPickup>
    </ac:referenceNumberResponse>
</soapenv:Body>
</soapenv:Envelope>
